{
	"@metadata": {
		"authors": [
			"Shirayuki",
			"Umherirrender",
			"Amire80",
			"Fhocutt",
			"Liuxinyu970226"
		]
	},
	"mabs-desc": "{{desc|name=MABS|url=https://github.com/hexmode/MABS }}",
	"mabs-setup": "Page title of the MABS setup special page.",
	"mabs-setup-intro": "Text displayed on the MABS setup SpecialPage.",
	"mabs-i18n-welcome": "Used to greet the user when reading the i18n/??.json file.",
	"mabs": "Text of the link to the MABS setupspecial page on SpecialPages.",
	"mabs-repoform-branchname": "Form field name",
	"mabs-repo-depo": "Description of Repo configurable",

	"mabs-no-wizard": "Title of error page for wizard",
	"mabs-dev-needed": "Message telling the user that the developer has to write some code.",
	"mabs-no-wizard-step-list": "Title of error page for an un-provided step list",
	"mabs-dev-needed-step-list": "Message telling the user that the developer has to provde a list of steps.",
	"mabs-no-wizard-step": "Title of error page for a missing wizard step",
	"mabs-dev-needed-step": "Message telling the user that the developer has to provide an implementation for a step.",

	"repoform-mabs-config-dependency-section": "Header of form for missing composer dependencies",
	"mabs-dependency-gitonomy": "Message to display if composer dependencies are missing",

	"repoform-mabs-config-prepare-section": "Header of form to prepare repository",
	"mabs-config-please-fix-exists": "Message to display if the repository does not exist.",
	"mabs-config-please-fix-directory": "Message to display if the repository path is not a directory.",
	"mabs-config-please-fix-writable": "Message to display if the repository path is not writable.",

	"repoform-mabs-config-initialize-section": "Header of form just before initialization.",
	"mabs-config-init-repo": "Error while creating the repository:\n$1",
	"mabs-config-create": "Message to display on the button that the user will click to perform some action",
	"mabs-config-try-again": "Message to display on the button to indicate that the user needs to do something before trying again.",
	"mabs-config-fix-problems": "Help message clarifying that the user has to fix some things in the system first.",
	"mabs-config-gitdir-not-writable": "Message to display if the dot-git directory in the repository is not writable",
	"mabs-config-not-exists": "Message to display if the config file does not exist.  Tell the user we're reaedy to initialize",
	"mabs-config-not-writable": "Message to display if the config file is not writable.",

	"repoform-mabs-config-complete-section": "Header of form when initialization is complete",
	"mabs-config-complete": "Informative message that the next step will be importing the wiki",
	"mabs-config-continue": "Label on the button to continue to import",

	"repoform-mabs-config-current-section": "Set the default remote",
	"mabs-config-remote": "This wiki is the remote for the repository we're setting up"
}
